In [2]:
file=open('data.csv','x')
file.close()

In [6]:
import pandas as pd
df=pd.read_csv('data.csv',nrows=4)
df

   sn   name  age        add       phone
0   1    Ram   34  Kathmandu  9808778765
1   2  Shyam   54  Bhaktapur  9809878765
2   3   Hari   32   Lalitpur  9808778765
3   4  Sabin   45      Jhapa  9808778765

In [9]:
import pandas as pd
df=pd.read_csv('data.csv')
df.head(3)

   sn   name  age        add       phone
0   1    Ram   34  Kathmandu  9808778765
1   2  Shyam   54  Bhaktapur  9809878765
2   3   Hari   32   Lalitpur  9808778765

In [11]:
df.tail(3)

   sn    name  age        add       phone
3   4   Sabin   45      Jhapa  9808778765
4   5   Nabin   56    Chitwan  9808778765
5   6  Sabina   33  Kathmandu  9808889876

In [13]:
df=pd.read_csv('data.csv',usecols=['sn','name','phone'])
df

   sn    name       phone
0   1     Ram  9808778765
1   2   Shyam  9809878765
2   3    Hari  9808778765
3   4   Sabin  9808778765
4   5   Nabin  9808778765
5   6  Sabina  9808889876

In [17]:
df=pd.read_csv('data.csv',index_col='sn')
df

      name  age        add       phone
sn
1      Ram   34  Kathmandu  9808778765
2    Shyam   54  Bhaktapur  9809878765
3     Hari   32   Lalitpur  9808778765
4    Sabin   45      Jhapa  9808778765
5    Nabin   56    Chitwan  9808778765
6   Sabina   33  Kathmandu  9808889876

In [20]:
df[['name','age']]

      name  age
sn
1      Ram   34
2    Shyam   54
3     Hari   32
4    Sabin   45
5    Nabin   56
6   Sabina   33

In [21]:
# iloc  loc

In [23]:
df.iloc[2:4]

     name  age       add       phone
sn
3    Hari   32  Lalitpur  9808778765
4   Sabin   45     Jhapa  9808778765

In [26]:
df.iloc[2:4]

     name  age       add       phone
sn
3    Hari   32  Lalitpur  9808778765
4   Sabin   45     Jhapa  9808778765

In [27]:
df.loc[2:5]

     name  age        add       phone
sn
2   Shyam   54  Bhaktapur  9809878765
3    Hari   32   Lalitpur  9808778765
4   Sabin   45      Jhapa  9808778765
5   Nabin   56    Chitwan  9808778765

In [34]:
df[df['name']=='Ram']

   name  age        add       phone
sn
1   Ram   34  Kathmandu  9808778765

In [35]:
df[df['age']> 40]

     name  age        add       phone
sn
2   Shyam   54  Bhaktapur  9809878765
4   Sabin   45      Jhapa  9808778765
5   Nabin   56    Chitwan  9808778765

In [41]:
df[(df['age']>40) & (df['name']=='Nabin')]

     name  age      add       phone
sn
5   Nabin   56  Chitwan  9808778765

In [44]:
# dict to dataframe

data={'name':['Ram','Shyam','Hari'],
     'age':[34,56,67],
     'add':['Kathmandu','Bhaktapur','Lalitpur']}
df=pd.DataFrame(data)
df

    name  age        add
0    Ram   34  Kathmandu
1  Shyam   56  Bhaktapur
2   Hari   67   Lalitpur

In [45]:
df.to_csv('info.csv')

In [48]:
import os
files=os.listdir()

if 'info.csv' in files:
    print('yes')
else:
    print('NO')

NO

In [49]:
pwd

'C:\\Users\\Rajan Kayastha\\Phython class'

In [50]:
import datetime

x = datetime.datetime.now()
print(x)

2023-11-27 19:11:28.164245

In [52]:
# list inside list to csv file

import csv
data = [['Ram',34,'Kathmandu'],
       ["Shyam",45,'Baluwatar']]
file=open('new info.csv','w')
x=csv.writer(file)
x.writerows(data)
file.close()

In [54]:

data = [['Ram',34,'Kathmandu'],
       ["Shyam",45,'Baluwatar']]

df=pd.DataFrame(data)
df.to_csv('new info 1.csv')